{
    "movies": [
      {
        "Title": "The Flash",
        "Year": "2014–",
        "Type": "series",
        "imdbID": "tt3107288",
        "Poster": "https://m.media-amazon.com/images/M/MV5BMDIzNzYwNTctZWY4Mi00YjQ2LWI5YWYtMzdmNDgwMGI4Yzk1XkEyXkFqcGdeQXVyMTkxNjUyNQ@@._V1_SX300.jpg",
        "Genre": "Action, Adventure, Drama",
        "Released": "07 Oct 2014",
        "Runtime": "43 min",
        "Rated": "TV-PG",
        "Director": "N/A",
        "Writer": "Greg Berlanti, Geoff Johns, Andrew Kreisberg",
        "Actors": "Grant Gustin, Candice Patton, Danielle Panabaker",
        "Awards": "Nominated for 1 Primetime Emmy. 28 wins & 90 nominations total",
        "Plot": "Barry Allen is a Central City police forensic scientist with a reasonably happy life, despite the childhood trauma of a mysterious red and yellow lightning killing his mother and framing his father. All that changes when a massive particle accelerator accident leads to Barry being struck by lightning in his lab. Coming out of coma nine months later, Barry and his new friends at S.T.A.R labs find that he now has the ability to move at superhuman speed. Furthermore, Barry learns that he is but one of many affected by that event, most of whom are using their powers for evil. Determined to make a difference, Barry dedicates his life to fighting such threats, as The Flash. While he gains allies he never expected, there are also secret forces determined to aid and manipulate him for their own agenda.",
        "totalSeasons": "8",
        "id": 2
      },
      {
        "Title": "Ricki and the Flash",
        "Year": "2015",
        "Type": "movie",
        "imdbID": "tt3623726",
        "Poster": "https://m.media-amazon.com/images/M/MV5BMTY1NzIxNzkzM15BMl5BanBnXkFtZTgwMzAzNjIzNjE@._V1_SX300.jpg",
        "Genre": "Comedy, Drama, Music",
        "Released": "07 Aug 2015",
        "Runtime": "101 min",
        "Rated": "PG-13",
        "Director": "Jonathan Demme",
        "Writer": "Diablo Cody",
        "Actors": "Meryl Streep, Kevin Kline, Mamie Gummer",
        "Awards": "4 nominations",
        "Plot": "A woman named Linda leaves her family to pursue her dream of being a rock star. And she hasn't achieved the notoriety she hoped for. Her ex-husband calls her to tell her that her daughter suffered a breakdown because her husband left her. She goes back to Indianapolis. But her daughter doesn't exactly welcome her with open arms. But she stays and tries. And her sons also don't welcome her warmly.",
        "id": 3
      },
      {
        "Title": "Toy Story",
        "Year": "1995",
        "Type": "movie",
        "imdbID": "tt0114709",
        "Poster": "https://m.media-amazon.com/images/M/MV5BMDU2ZWJlMjktMTRhMy00ZTA5LWEzNDgtYmNmZTEwZTViZWJkXkEyXkFqcGdeQXVyNDQ2OTk4MzI@._V1_SX300.jpg",
        "Genre": "Animation, Adventure, Comedy",
        "Released": "22 Nov 1995",
        "Runtime": "81 min",
        "Rated": "G",
        "Director": "John Lasseter",
        "Writer": "John Lasseter, Pete Docter, Andrew Stanton",
        "Actors": "Tom Hanks, Tim Allen, Don Rickles",
        "Awards": "Won 1 Oscar. 27 wins & 23 nominations total",
        "Plot": "A little boy named Andy loves to be in his room, playing with his toys, especially his doll named \"Woody\". But, what do the toys do when Andy is not with them, they come to life. Woody believes that his life (as a toy) is good. However, he must worry about Andy's family moving, and what Woody does not know is about Andy's birthday party. Woody does not realize that Andy's mother gave him an action figure known as Buzz Lightyear, who does not believe that he is a toy, and quickly becomes Andy's new favorite toy. Woody, who is now consumed with jealousy, tries to get rid of Buzz. Then, both Woody and Buzz are now lost. They must find a way to get back to Andy before he moves without them, but they will have to pass through a ruthless toy killer, Sid Phillips.",
        "id": 4
      },
      {
        "Title": "Toy Story 2",
        "Year": "1999",
        "Type": "movie",
        "imdbID": "tt0120363",
        "Poster": "https://m.media-amazon.com/images/M/MV5BMWM5ZDcxMTYtNTEyNS00MDRkLWI3YTItNThmMGExMWY4NDIwXkEyXkFqcGdeQXVyNjUwNzk3NDc@._V1_SX300.jpg",
        "Genre": "Animation, Adventure, Comedy",
        "Released": "24 Nov 1999",
        "Runtime": "92 min",
        "Rated": "G",
        "Director": "John Lasseter, Ash Brannon, Lee Unkrich",
        "Writer": "John Lasseter, Pete Docter, Ash Brannon",
        "Actors": "Tom Hanks, Tim Allen, Joan Cusack",
        "Awards": "Nominated for 1 Oscar. 21 wins & 27 nominations total",
        "Plot": "While Andy is away at summer camp Woody has been toynapped by Al McWiggin, a greedy collector and proprietor of \"Al's Toy Barn\"! In this all-out rescue mission, Buzz and his friends Mr. Potato Head, Slinky Dog, Rex and Hamm springs into action to rescue Woody from winding up as a museum piece. They must find a way to save him before he gets sold in Japan forever and they'll never see him again!",
        "id": 5
      },
      {
        "Title": "Toy Story 3",
        "Year": "2010",
        "Type": "movie",
        "imdbID": "tt0435761",
        "Poster": "https://m.media-amazon.com/images/M/MV5BMTgxOTY4Mjc0MF5BMl5BanBnXkFtZTcwNTA4MDQyMw@@._V1_SX300.jpg",
        "Genre": "Animation, Adventure, Comedy",
        "Released": "18 Jun 2010",
        "Runtime": "103 min",
        "Rated": "G",
        "Director": "Lee Unkrich",
        "Writer": "John Lasseter, Andrew Stanton, Lee Unkrich",
        "Actors": "Tom Hanks, Tim Allen, Joan Cusack",
        "Awards": "Won 2 Oscars. 61 wins & 96 nominations total",
        "Plot": "Woody, Buzz and the whole gang are back. As their owner Andy prepares to depart for college, his loyal toys find themselves in daycare where untamed tots with their sticky little fingers do not play nice. So, it's all for one and one for all as they join Barbie's counterpart Ken, a thespian hedgehog named Mr. Pricklepants and a pink, strawberry-scented teddy bear called Lots-o'-Huggin' Bear to plan their great escape.",
        "id": 6
      },
      {
        "Title": "Deadpool",
        "Year": "2016",
        "Type": "movie",
        "imdbID": "tt1431045",
        "Poster": "https://m.media-amazon.com/images/M/MV5BYzE5MjY1ZDgtMTkyNC00MTMyLThhMjAtZGI5OTE1NzFlZGJjXkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_SX300.jpg",
        "Genre": "Action, Adventure, Comedy",
        "Released": "12 Feb 2016",
        "Runtime": "108 min",
        "Rated": "R",
        "Director": "Tim Miller",
        "Writer": "Rhett Reese, Paul Wernick",
        "Actors": "Ryan Reynolds, Morena Baccarin, T.J. Miller",
        "Awards": "28 wins & 78 nominations",
        "Plot": "This is the origin story of former Special Forces operative turned mercenary Wade Wilson, who after being subjected to a rogue experiment that leaves him with accelerated healing powers, adopts the alter ego Deadpool. Armed with his new abilities and a dark, twisted sense of humor, Deadpool hunts down the man who nearly destroyed his life.",
        "id": 8
      },
      {
        "Title": "Saw",
        "Year": "2004",
        "Type": "movie",
        "imdbID": "tt0387564",
        "Poster": "https://m.media-amazon.com/images/M/MV5BMzQ2ZTBhNmEtZDBmYi00ODU0LTgzZmQtNmMxM2M4NzM1ZjE4XkEyXkFqcGdeQXVyNjE5MjUyOTM@._V1_SX300.jpg",
        "Genre": "Horror, Mystery, Thriller",
        "Released": "29 Oct 2004",
        "Runtime": "103 min",
        "Rated": "R",
        "Director": "James Wan",
        "Writer": "Leigh Whannell, James Wan",
        "Actors": "Cary Elwes, Leigh Whannell, Danny Glover",
        "Awards": "8 wins & 10 nominations",
        "Plot": "Waking up in a bathroom, two men, Adam and Dr. Lawrence Gordon, discover they have been captured by the infamous Jigsaw Killer. The men must escape before time runs out, otherwise, they will face the deadly consequences.",
        "id": 9
      },
      {
        "Title": "Arrow",
        "Year": "2012–2020",
        "Type": "series",
        "imdbID": "tt2193021",
        "Poster": "https://m.media-amazon.com/images/M/MV5BMTI0NTMwMDgtYTMzZC00YmJhLTg4NzMtMTc1NjI4MWY4NmQ4XkEyXkFqcGdeQXVyNTY3MTYzOTA@._V1_SX300.jpg",
        "Genre": "Action, Adventure, Crime",
        "Released": "10 Oct 2012",
        "Runtime": "42 min",
        "Rated": "TV-14",
        "Director": "N/A",
        "Writer": "Greg Berlanti, Marc Guggenheim, Andrew Kreisberg",
        "Actors": "Stephen Amell, Katie Cassidy, David Ramsey",
        "Awards": "22 wins & 88 nominations",
        "Plot": "Oliver Queen and his father are lost at sea when their luxury yacht sinks, apparently in a storm. His father dies, but Oliver survives for five years on an uncharted island and eventually returns home. But he wasn't alone on the island where he learned not only how to fight and survive but also of his father's corruption and unscrupulous business dealings. He returns to civilization a changed man, determined to put things right. He disguises himself with the hood of one of his mysterious island mentors, arms himself with a bow and sets about hunting down the men and women who have corrupted his city.",
        "totalSeasons": "8",
        "id": 10
      },
      {
        "Title": "Batman v Superman: Dawn of Justice",
        "Year": "2016",
        "Type": "movie",
        "imdbID": "tt2975590",
        "Poster": "https://m.media-amazon.com/images/M/MV5BYThjYzcyYzItNTVjNy00NDk0LTgwMWQtYjMwNmNlNWJhMzMyXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SX300.jpg",
        "Genre": "Action, Adventure, Sci-Fi",
        "Released": "25 Mar 2016",
        "Runtime": "152 min",
        "Rated": "PG-13",
        "Director": "Zack Snyder",
        "Writer": "Chris Terrio, David S. Goyer, Bob Kane",
        "Actors": "Ben Affleck, Henry Cavill, Amy Adams",
        "Awards": "14 wins & 33 nominations",
        "Plot": "The general public is concerned over having Superman on their planet and letting the \"Dark Knight\" - Batman - pursue the streets of Gotham. While this is happening, a power-phobic Batman tries to attack Superman. Meanwhile, Superman tries to settle on a decision, and Lex Luthor, the criminal mastermind and millionaire, tries to use his own advantages to fight the \"Man of Steel\".",
        "id": 11
      },
      {
        "Title": "Pulp Fiction",
        "Year": "1994",
        "Type": "movie",
        "imdbID": "tt0110912",
        "Poster": "https://m.media-amazon.com/images/M/MV5BNGNhMDIzZTUtNTBlZi00MTRlLWFjM2ItYzViMjE3YzI5MjljXkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_SX300.jpg",
        "Genre": "Crime, Drama",
        "Released": "14 Oct 1994",
        "Runtime": "154 min",
        "Rated": "R",
        "Director": "Quentin Tarantino",
        "Writer": "Quentin Tarantino, Roger Avary",
        "Actors": "John Travolta, Uma Thurman, Samuel L. Jackson",
        "Awards": "Won 1 Oscar. 70 wins & 75 nominations total",
        "Plot": "Jules Winnfield (Samuel L. Jackson) and Vincent Vega (John Travolta) are two hit men who are out to retrieve a suitcase stolen from their employer, mob boss Marsellus Wallace (Ving Rhames). Wallace has also asked Vincent to take his wife Mia (Uma Thurman) out a few days later when Wallace himself will be out of town. Butch Coolidge (Bruce Willis) is an aging boxer who is paid by Wallace to lose his fight. The lives of these seemingly unrelated people are woven together comprising of a series of funny, bizarre and uncalled-for incidents.",
        "id": 12
      },
      {
        "Title": "Jaws: The Revenge",
        "Year": "1987",
        "Type": "movie",
        "imdbID": "tt0093300",
        "Poster": "https://m.media-amazon.com/images/M/MV5BNGI1MTAxMWItOTE0OC00ZDhkLWE3Y2EtNjFiZmQ4NjQ1NGNkXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SX300.jpg",
        "Genre": "Adventure, Horror, Thriller",
        "Released": "17 Jul 1987",
        "Runtime": "89 min",
        "Rated": "PG-13",
        "Director": "Joseph Sargent",
        "Writer": "Peter Benchley, Michael De Guzman",
        "Actors": "Lorraine Gary, Lance Guest, Mario Van Peebles",
        "Awards": "1 win & 7 nominations",
        "Plot": "After the encounter with the shark at Sea World, Sean Brody has returned to Amity. Here he has assumed his father's role, working for the police department, and is engaged to a young woman named Tiffany. His mother, Ellen, still lives in Amity as well. Mike Brody is now married to Carla and is researching conch snails with his partner, Jake, in the Bahamas. One night, while repairing a buoy in Amity harbor from the police boat, Sean is ambushed from below and killed by the Brodys' old enemy, a Great White shark. After the funeral, Ellen wants Mike to stay off the water, but he refuses, and takes Ellen back to the Caribbean with him and his wife and daughter, Thea. Ellen starts trying to enjoy life again, meeting charming pilot Hoagie after having been a widow for some time. Mike and Jake encounter the Great White shark in the water, and tag and track it for research. But the shark soon starts wreaking havoc, and comes after Thea on a banana boat ride. Now, Ellen, Mike, Jake, and Hoagie will face the shark on his terms. Who will survive?",
        "id": 13
      },
      {
        "Title": "Jaws",
        "Year": "1975",
        "Type": "movie",
        "imdbID": "tt0073195",
        "Poster": "https://m.media-amazon.com/images/M/MV5BMmVmODY1MzEtYTMwZC00MzNhLWFkNDMtZjAwM2EwODUxZTA5XkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_SX300.jpg",
        "Genre": "Adventure, Thriller",
        "Released": "20 Jun 1975",
        "Runtime": "124 min",
        "Rated": "PG",
        "Director": "Steven Spielberg",
        "Writer": "Peter Benchley, Carl Gottlieb",
        "Actors": "Roy Scheider, Robert Shaw, Richard Dreyfuss",
        "Awards": "Won 3 Oscars. 15 wins & 20 nominations total",
        "Plot": "It's a hot summer on Amity Island, a small community whose main business is its beaches. When new Sheriff Martin Brody discovers the remains of a shark attack victim, his first inclination is to close the beaches to swimmers. This doesn't sit well with Mayor Larry Vaughn and several of the local businessmen. Brody backs down to his regret as that weekend a young boy is killed by the predator. The dead boy's mother puts out a bounty on the shark and Amity is soon swamped with amateur hunters and fisherman hoping to cash in on the reward. A local fisherman with much experience hunting sharks, Quint, offers to hunt down the creature for a hefty fee. Soon Quint, Brody and Matt Hooper from the Oceanographic Institute are at sea hunting the Great White shark. As Brody succinctly surmises after their first encounter with the creature, they're going to need a bigger boat.",
        "id": 14
      }
    ]
  }